In [114]:
import pandas as pd

# Data to create the table
data = {
    "car_name": [
        "Jeep Compass 2.0 Longitude Option BSIV",
        "Renault Duster RXZ Turbo CVT",
        "Toyota Camry 2.5 G",
        "Honda Jazz VX CVT"
    ],
    "car_prices_in_rupee": ["10.03 Lakh", " ", "16.4", "7.77 Crore"],
    "kms_driven": ["86,226 kms", " ", "60,343 kms", "26,696 kms"],
    "fuel_type": ["Diesel", "Petrol", "Petrol", "Petrol"],
    "transmission": ["Manual", "Automatic", "Automatic", "Automatic"],
    "ownership": ["1st Owner", "1st Owner", "1st Owner", "1st Owner"],
    "manufacture": [
        "January 15,2017",
        "January 15,2018",
        "January 15,2019",
        "January 15,2020"
    ],
    "engine": ["1956 cc", "1330 cc", "2494 cc", "1199 cc"],
    "Seats": ["5 Seats", "5 Seats", "5 Seats", "5 Seats"]
}

# Create DataFrame
df = pd.DataFrame(data)

# Display the DataFrame
print(df)

                                 car_name car_prices_in_rupee  kms_driven  \
0  Jeep Compass 2.0 Longitude Option BSIV          10.03 Lakh  86,226 kms
1            Renault Duster RXZ Turbo CVT
2                      Toyota Camry 2.5 G                16.4  60,343 kms
3                       Honda Jazz VX CVT          7.77 Crore  26,696 kms

  fuel_type transmission  ownership      manufacture   engine    Seats
0    Diesel       Manual  1st Owner  January 15,2017  1956 cc  5 Seats
1    Petrol    Automatic  1st Owner  January 15,2018  1330 cc  5 Seats
2    Petrol    Automatic  1st Owner  January 15,2019  2494 cc  5 Seats
3    Petrol    Automatic  1st Owner  January 15,2020  1199 cc  5 Seats

In [115]:
df

,car_name,car_prices_in_rupee,kms_driven,fuel_type,transmission,ownership,manufacture,engine,Seats
0,Jeep Compass 2.0 Longitude Option BSIV,10.03 Lakh,"86,226 kms",Diesel,Manual,1st Owner,"January 15,2017",1956 cc,5 Seats
1,Renault Duster RXZ Turbo CVT,,,Petrol,Automatic,1st Owner,"January 15,2018",1330 cc,5 Seats
2,Toyota Camry 2.5 G,16.4,"60,343 kms",Petrol,Automatic,1st Owner,"January 15,2019",2494 cc,5 Seats
3,Honda Jazz VX CVT,7.77 Crore,"26,696 kms",Petrol,Automatic,1st Owner,"January 15,2020",1199 cc,5 Seats

### Working with a single Data

In [116]:
df.head(1)

,car_name,car_prices_in_rupee,kms_driven,fuel_type,transmission,ownership,manufacture,engine,Seats
0,Jeep Compass 2.0 Longitude Option BSIV,10.03 Lakh,"86,226 kms",Diesel,Manual,1st Owner,"January 15,2017",1956 cc,5 Seats

# Here Not Showing The NaN value That's Why working With The CSV file Now

In [117]:
dataset = pd.read_csv('Car_Price_MyOwn_Data.csv')

In [118]:
dataset

,car_name,car_prices_in_rupee,kms_driven,fuel_type,transmission,ownership,manufacture,engine,Seats
0,Jeep Compass 2.0 Longitude Option BSIV,10.03 Lakh,"86,226 kms",Diesel,Manual,1st Owner,"January 15,2017",1956 cc,5 Seats
1,Renault Duster RXZ Turbo CVT,NaN,"13,248 kms",Petrol,Automatic,1st Owner,"January 15,2018",1330 cc,5 Seats
2,Toyota Camry 2.5 G,16.4,"60,343 kms",Petrol,Automatic,1st Owner,"January 15,2019",2494 cc,5 Seats
3,Honda Jazz VX CVT,16.40 Crore,"26,696 kms",Petrol,Automatic,1st Owner,"March 15,2020",1199 cc,5 Seats
4,Mahindra XUV300 W6,"35,000","65,000 kms",Diesel,Automatic,2nd Owner,"January 15,2020",2000 cc,2 Seats

### Alwyas will Work with a single Row

In [119]:
dataset.head(1)

,car_name,car_prices_in_rupee,kms_driven,fuel_type,transmission,ownership,manufacture,engine,Seats
0,Jeep Compass 2.0 Longitude Option BSIV,10.03 Lakh,"86,226 kms",Diesel,Manual,1st Owner,"January 15,2017",1956 cc,5 Seats

### To see the Overall Data

In [120]:
dataset.shape

(5, 9)

### To see the only Rows

In [121]:
dataset.shape[0]

5

### To See the DataType

In [122]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 9 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   car_name             5 non-null      object
 1   car_prices_in_rupee  4 non-null      object
 2   kms_driven           5 non-null      object
 3   fuel_type            5 non-null      object
 4   transmission         5 non-null      object
 5   ownership            5 non-null      object
 6   manufacture          5 non-null      object
 7   engine               5 non-null      object
 8   Seats                5 non-null      object
dtypes: object(9)
memory usage: 492.0+ bytes

# Missing Content

### 1st work is to remove the missing content or place some data in the missing content

In [123]:
#True means --> missing Content 
# False means --> not missing content
dataset.isnull()

,car_name,car_prices_in_rupee,kms_driven,fuel_type,transmission,ownership,manufacture,engine,Seats
0,False,False,False,False,False,False,False,False,False
1,False,True,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False

In [124]:
# sum() er folee jar joto missing content aceh , sheta jante parbo !!
dataset.isnull().sum()

car_name               0
car_prices_in_rupee    1
kms_driven             0
fuel_type              0
transmission           0
ownership              0
manufacture            0
engine                 0
Seats                  0
dtype: int64

### For good observation , we have to find this in Percentage form

In [125]:
# To find the Percentage of Missing content 
(dataset.isnull().sum()/dataset.shape[0])*100

car_name                0.0
car_prices_in_rupee    20.0
kms_driven              0.0
fuel_type               0.0
transmission            0.0
ownership               0.0
manufacture             0.0
engine                  0.0
Seats                   0.0
dtype: float64

### To remove the missing Data

In [126]:
#permenetly removed the missing content 
dataset.dropna(inplace=True)

In [127]:
#To see the NaN is permanently is deleted or not !!
dataset

,car_name,car_prices_in_rupee,kms_driven,fuel_type,transmission,ownership,manufacture,engine,Seats
0,Jeep Compass 2.0 Longitude Option BSIV,10.03 Lakh,"86,226 kms",Diesel,Manual,1st Owner,"January 15,2017",1956 cc,5 Seats
2,Toyota Camry 2.5 G,16.4,"60,343 kms",Petrol,Automatic,1st Owner,"January 15,2019",2494 cc,5 Seats
3,Honda Jazz VX CVT,16.40 Crore,"26,696 kms",Petrol,Automatic,1st Owner,"March 15,2020",1199 cc,5 Seats
4,Mahindra XUV300 W6,"35,000","65,000 kms",Diesel,Automatic,2nd Owner,"January 15,2020",2000 cc,2 Seats

# One By One Column Obeservtion

### Car_name

In [128]:
dataset['car_name']

0    Jeep Compass 2.0 Longitude Option BSIV
2                        Toyota Camry 2.5 G
3                         Honda Jazz VX CVT
4                        Mahindra XUV300 W6
Name: car_name, dtype: object

------------------------------------->>>>To separate carName and Company Name <<<<<<<-----------------------------------

In [129]:
# WE Will work on a Data only , then entire Data
dataset['car_name'][0]

'Jeep Compass 2.0 Longitude Option BSIV'

In [130]:
# I will use Slicing to separate the Car name and Company Name 
x=dataset['car_name'][0]
x[:x.index(" ")] # For Specific Data, so entire Data I will have to create the customize function

'Jeep'

In [131]:
# To Create the customize function --> for the company_name
def company_name(x):
    return x[:x.index(" ")]

In [132]:
dataset["car_name"].apply(company_name)

0        Jeep
2      Toyota
3       Honda
4    Mahindra
Name: car_name, dtype: object

In [133]:
# TO add this in the Main Dataset we will do is .......
dataset["company_name"]=dataset["car_name"].apply(company_name)

In [134]:
dataset

,car_name,car_prices_in_rupee,kms_driven,fuel_type,transmission,ownership,manufacture,engine,Seats,company_name
0,Jeep Compass 2.0 Longitude Option BSIV,10.03 Lakh,"86,226 kms",Diesel,Manual,1st Owner,"January 15,2017",1956 cc,5 Seats,Jeep
2,Toyota Camry 2.5 G,16.4,"60,343 kms",Petrol,Automatic,1st Owner,"January 15,2019",2494 cc,5 Seats,Toyota
3,Honda Jazz VX CVT,16.40 Crore,"26,696 kms",Petrol,Automatic,1st Owner,"March 15,2020",1199 cc,5 Seats,Honda
4,Mahindra XUV300 W6,"35,000","65,000 kms",Diesel,Automatic,2nd Owner,"January 15,2020",2000 cc,2 Seats,Mahindra

In [135]:
# To Create the customize function --> for the car_name
def car_name(x):
    return x[x.index(" ")+1:]

In [136]:
dataset["car_name"].apply(car_name)

0    Compass 2.0 Longitude Option BSIV
2                          Camry 2.5 G
3                          Jazz VX CVT
4                            XUV300 W6
Name: car_name, dtype: object

In [137]:
dataset["car_name"]=dataset["car_name"].apply(car_name)

In [138]:
dataset

,car_name,car_prices_in_rupee,kms_driven,fuel_type,transmission,ownership,manufacture,engine,Seats,company_name
0,Compass 2.0 Longitude Option BSIV,10.03 Lakh,"86,226 kms",Diesel,Manual,1st Owner,"January 15,2017",1956 cc,5 Seats,Jeep
2,Camry 2.5 G,16.4,"60,343 kms",Petrol,Automatic,1st Owner,"January 15,2019",2494 cc,5 Seats,Toyota
3,Jazz VX CVT,16.40 Crore,"26,696 kms",Petrol,Automatic,1st Owner,"March 15,2020",1199 cc,5 Seats,Honda
4,XUV300 W6,"35,000","65,000 kms",Diesel,Automatic,2nd Owner,"January 15,2020",2000 cc,2 Seats,Mahindra

### Car_Price_in_Rupee

In [139]:
dataset["car_prices_in_rupee"]

0     10.03 Lakh
2           16.4
3    16.40 Crore
4         35,000
Name: car_prices_in_rupee, dtype: object

35,000, 10.03 Lakh, 16.40 Crore
-->In pandas Under a number comma is not supported 
--> Lakh has to remove 
--> Crore has to remove too

In [ ]:
                 ---------------------->>> Concept of removing Something Form the Date <<<<<<<<<<<<<<<<----------------------------------

'''
# Remove the coma first ---> using [str] and [replace]   ==> like 35,000
dataset["car_prices_in_rupee"] = dataset["car_prices_in_rupee"].str.replace(",","") 

output: 
 35000

1956 cc

#To remove this CC
# Remove the sapce with cc first --> using [str] and [replace]
dataset["engine"] = dataset["engine"].str.replace(" cc","")

Output: 
 1956

January 15,2017

#To Remove the coma first ---> using [str] and [replace]
dataset["manufacture"] = dataset["manufacture"].str.replace(","," ,")

Output : 
 2017-01-15

 '''

In [140]:
# Remove the coma first ---> using [str] and [replace]   ==> like 35,000
dataset["car_prices_in_rupee"] = dataset["car_prices_in_rupee"].str.replace(",","")

In [141]:
# 16.40 crore --> 16.40* 100000000
16.40* 100000000

# ["16.40", "Crore"] ekhane 0 index = 16.40-->p[0]   And Crore hocce = 1 index -->p[1]
# ["10.03", "Lakh"] ekhane 0 index = 10.03-->p[0]  And Lakh hocce = 1 index -->p[1]

1639999999.9999998

In [142]:
# The steps that i am going to do is--> Step: 1
l= "10.03 Lakh"
a = l.split(" ")
a # Now I will find the Data in the list

['10.03', 'Lakh']

In [143]:
# Working with 28.90 or index = zero --> step: 2
l= "10.03 Lakh"
a = l.split(" ")
a[0]

'10.03'

In [144]:
# Convertng this into Float --> Step: 3
l= "10.03 Lakh"
a = l.split(" ")
float(a[0])

10.03

In [145]:
# Now I Will Multiply this value 28.9 by 100000 -> so that I find the Number in thousands --> step: 4
l= "10.03 Lakh"
a = l.split(" ")
float(a[0])*100000

1002999.9999999999

In [146]:
# If any round value, to reduce that mistake we will use the Round function --> step: 5
#Such that round(3.14159, 2) rounds the number to two decimal places, resulting in 3.14.
l= "10.03 Lakh"
a = l.split(" ")
round(float(a[0])*100000,1)

1003000.0

                                       -->>>>>>># Step: 1 To Step: 5 in Coding style #<<<<--------------

In [147]:
# To Create this Function And -> pura process jeta hocce sheta String Format e convert kore again insert korteci 

#try and except: Handles unexpected errors (like missing or malformed input) and prevents your program from crashing.
#else: Provides an alternative path if none of the if or elif conditions are met, but it does not handle errors.


def rupe_change(x):
    p = x.split(" ")
    try:
        if p[1] == "Lakh":
            return str(round(float(p[0]) * 100000, 1))
        elif p[1] == "Crore":
            return str(round(float(p[0]) * 10000000, 1))
    except:
        return x

In [148]:
dataset["car_prices_in_rupee"].apply(rupe_change)

0      1003000.0
2           16.4
3    164000000.0
4          35000
Name: car_prices_in_rupee, dtype: object

In [149]:
# To check the conversion type
dataset["car_prices_in_rupee"] =dataset["car_prices_in_rupee"].apply(rupe_change)

In [150]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 0 to 4
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   car_name             4 non-null      object
 1   car_prices_in_rupee  4 non-null      object
 2   kms_driven           4 non-null      object
 3   fuel_type            4 non-null      object
 4   transmission         4 non-null      object
 5   ownership            4 non-null      object
 6   manufacture          4 non-null      object
 7   engine               4 non-null      object
 8   Seats                4 non-null      object
 9   company_name         4 non-null      object
dtypes: object(10)
memory usage: 524.0+ bytes

In [151]:
# In the above section I see, the car_price_in_rupee is still in Object Form  
# So let's Convert this into float Value 

dataset["car_prices_in_rupee"].astype("float") # Now it is converted into floating Value

0      1003000.0
2           16.4
3    164000000.0
4        35000.0
Name: car_prices_in_rupee, dtype: float64

In [152]:
#Now loading this into the Dataset
dataset["car_prices_in_rupee"]=dataset["car_prices_in_rupee"].astype("float64") # Now it is converted into floating Value

In [153]:
dataset

,car_name,car_prices_in_rupee,kms_driven,fuel_type,transmission,ownership,manufacture,engine,Seats,company_name
0,Compass 2.0 Longitude Option BSIV,1003000.0,"86,226 kms",Diesel,Manual,1st Owner,"January 15,2017",1956 cc,5 Seats,Jeep
2,Camry 2.5 G,16.4,"60,343 kms",Petrol,Automatic,1st Owner,"January 15,2019",2494 cc,5 Seats,Toyota
3,Jazz VX CVT,164000000.0,"26,696 kms",Petrol,Automatic,1st Owner,"March 15,2020",1199 cc,5 Seats,Honda
4,XUV300 W6,35000.0,"65,000 kms",Diesel,Automatic,2nd Owner,"January 15,2020",2000 cc,2 Seats,Mahindra

### Kms_driveen

In [154]:
# I Have to remove the coma here and Kms As well , simplify problem only 
dataset["kms_driven"]

0    86,226 kms
2    60,343 kms
3    26,696 kms
4    65,000 kms
Name: kms_driven, dtype: object

In [155]:
# Remove the coma first ---> using [str] and [replace]
dataset["kms_driven"] = dataset["kms_driven"].str.replace(",","")

In [156]:
# Remove the sapce with kms first --> using [str] and [replace]
dataset["kms_driven"] = dataset["kms_driven"].str.replace(" kms","")

In [157]:
dataset['kms_driven'] # But it is Object from Data or String type Data

0    86226
2    60343
3    26696
4    65000
Name: kms_driven, dtype: object

In [158]:
# Dat convert this object form to Integer Type Data
dataset['kms_driven'].astype("int64")

0    86226
2    60343
3    26696
4    65000
Name: kms_driven, dtype: int64

In [159]:
#Now loading this into the Dataset
dataset["kms_driven"]=dataset['kms_driven'].astype("int64")

In [160]:
dataset

,car_name,car_prices_in_rupee,kms_driven,fuel_type,transmission,ownership,manufacture,engine,Seats,company_name
0,Compass 2.0 Longitude Option BSIV,1003000.0,86226,Diesel,Manual,1st Owner,"January 15,2017",1956 cc,5 Seats,Jeep
2,Camry 2.5 G,16.4,60343,Petrol,Automatic,1st Owner,"January 15,2019",2494 cc,5 Seats,Toyota
3,Jazz VX CVT,164000000.0,26696,Petrol,Automatic,1st Owner,"March 15,2020",1199 cc,5 Seats,Honda
4,XUV300 W6,35000.0,65000,Diesel,Automatic,2nd Owner,"January 15,2020",2000 cc,2 Seats,Mahindra

### Fuel_Type

I will keep this  as it is .......

### Transmissoin

I will keep this as it is........

### Ownership

I will keep this as it  but i will have to encode this in 1st order , 2nd order ..But will do it next time ...

### Engine

In [161]:
# i have to remove the cc 
dataset["engine"]

0    1956 cc
2    2494 cc
3    1199 cc
4    2000 cc
Name: engine, dtype: object

In [162]:
# Remove the sapce with cc first --> using [str] and [replace]
dataset["engine"] = dataset["engine"].str.replace(" cc","")

In [163]:
# Dat convert this object form to Integer Type Data
dataset["engine"]=dataset['engine'].astype("int64")

In [164]:
dataset

,car_name,car_prices_in_rupee,kms_driven,fuel_type,transmission,ownership,manufacture,engine,Seats,company_name
0,Compass 2.0 Longitude Option BSIV,1003000.0,86226,Diesel,Manual,1st Owner,"January 15,2017",1956,5 Seats,Jeep
2,Camry 2.5 G,16.4,60343,Petrol,Automatic,1st Owner,"January 15,2019",2494,5 Seats,Toyota
3,Jazz VX CVT,164000000.0,26696,Petrol,Automatic,1st Owner,"March 15,2020",1199,5 Seats,Honda
4,XUV300 W6,35000.0,65000,Diesel,Automatic,2nd Owner,"January 15,2020",2000,2 Seats,Mahindra

### Seats

In [165]:
# I have to remove the seats here 
dataset["Seats"]

0    5 Seats
2    5 Seats
3    5 Seats
4    2 Seats
Name: Seats, dtype: object

In [166]:
# Remove the sapce with Seats first --> using [str] and [replace]
dataset["Seats"] = dataset["Seats"].str.replace(" Seats","")

In [167]:
# Dat convert this object form to Integer Type Data
dataset["Seats"]=dataset['Seats'].astype("int64")

In [168]:
dataset

,car_name,car_prices_in_rupee,kms_driven,fuel_type,transmission,ownership,manufacture,engine,Seats,company_name
0,Compass 2.0 Longitude Option BSIV,1003000.0,86226,Diesel,Manual,1st Owner,"January 15,2017",1956,5,Jeep
2,Camry 2.5 G,16.4,60343,Petrol,Automatic,1st Owner,"January 15,2019",2494,5,Toyota
3,Jazz VX CVT,164000000.0,26696,Petrol,Automatic,1st Owner,"March 15,2020",1199,5,Honda
4,XUV300 W6,35000.0,65000,Diesel,Automatic,2nd Owner,"January 15,2020",2000,2,Mahindra

### Manufacturing Date

In [180]:
dataset["manufacture"]

0    January 15,2017
2    January 15,2019
3      March 15,2020
4    January 15,2020
Name: manufacture, dtype: object

what i have to do is , convert this into the proper Date form

In [181]:
# Remove the coma first ---> using [str] and [replace]
dataset["manufacture"] = dataset["manufacture"].str.replace(",",", ")

In [182]:
pd.to_datetime(dataset['manufacture'])

0   2017-01-15
2   2019-01-15
3   2020-03-15
4   2020-01-15
Name: manufacture, dtype: datetime64[ns]

In [183]:
dataset["manufacture"]=pd.to_datetime(dataset['manufacture'])

In [184]:
dataset

,car_name,car_prices_in_rupee,kms_driven,fuel_type,transmission,ownership,manufacture,engine,Seats,company_name
0,Compass 2.0 Longitude Option BSIV,1003000.0,86226,Diesel,Manual,1st Owner,2017-01-15,1956,5,Jeep
2,Camry 2.5 G,16.4,60343,Petrol,Automatic,1st Owner,2019-01-15,2494,5,Toyota
3,Jazz VX CVT,164000000.0,26696,Petrol,Automatic,1st Owner,2020-03-15,1199,5,Honda
4,XUV300 W6,35000.0,65000,Diesel,Automatic,2nd Owner,2020-01-15,2000,2,Mahindra

# --->>>Now this full Data Set is Ready for The data Analytics<<<-----

#                                                      -->> The End <<---

### Now way to Save the DataFram in CSE File to my Decstop

In [190]:
dataset.to_csv(r'F:\Python with Data Analytics\Practise\CleanedData.csv')